# -*- coding: utf-8 -*-
"""
Created on Mon Mar 20 12:09:26 2023
@FileName: .py
@author: YUNJUSEOK
@Link:
"""


'''
이항 계수란    N          n!
           (     ) == --------
              K       r!(n−r)!
              


'''
n, r = map( int ,input().split())

'''

임의의 수 k라 가정

( k, k ) 부터( n, k ) 까지 갈때

k항 은 k! / k!( k - k )! == 1

k + 1 항은 ( k + 1 )! / k!( k + 1 - k )!

k + 2 항은 ( k + 2 )! / k!( k + 2 - k )!



1 1 1 1 1 1 1 1 1

1 2 3 4 5 6 7 8 9

1 1 3 6 10 15 21 28 36

1 1 1 4 10 20 35 56 84 


( 1, 1 ) = 1!/ 1!

( 1, 2 ) = 불가능 


( 1, 1 ) = 1! / 1!

( 2, 1 ) = 2! / 1!( 2- 1 )! == 2

( 3, 1 ) = 3! / 1!( 3 - 1 )! == 3

( 4, 1 ) = 4! / 1!( 4 - 1 )! == 4


( 3, 1 ) = 3! / 1!( 3 - 1 )! == 3 

( 3, 2 ) = 3! / 2!( 3 - 2 )! == 3


( 5, 1 ) == 5! / 1!( 5 - 1 )! == 5;
( 5, 2 ) == 5! / 2!( 5 - 2 )! == 10
( 5, 3 ) == 5! / 3!( 5 - 3 )! == 10
( 5, 4 ) == 5! / 4! 1! == 5;




'''

dp = [ [ 1 ] * ( n + 1 ) for _ in range( r + 1 ) ];

if( r == 0 ):
    print( 1 );
else:
    

    for i in range( r + 1 ):
        dp[ 1 ][ i ] = i; 
    
    
    for i in range( 1, r + 1 ):
        for j in range( i + 1, n + 1 ):
            
            dp[ i ][ j ] = ( dp[ i - 1 ][ j - 1 ] + dp[ i ][ j - 1 ] ) % 10007;
    
    print( dp[ r ][ n ] )